Revit 2027 API
BuiltInFailures.CutFailures.CannotCutGeometryWarn Property
 Elements do not intersect.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCutGeometryWarn { get; }
Public Shared ReadOnly Property CannotCutGeometryWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCutGeometryWarn {
	FailureDefinitionId^ get ();
}
static member CannotCutGeometryWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CutFailures Class
Autodesk.Revit.DB Namespace